'''
* ==================================================================

* Description: multiplication table.py
* Author: Konrad Locas.
* (C)Copyright Konrad Locas.
* All rights reserved.
* Date: 2023/04/03 21:31:35

* ===================================================================
'''
i=1#行数，也是所乘的后一个数
j=1#前一个数
while i<10:#外层循环，确定行数为9
    while i>=j:#内层循环，每行式子的个数
        print(f"{j}×{i}=",i*j,end='\t')#输出形式
        j +=1#改变前一个数的值
    print()#每结束一行，换行
    j=1#给前一个数赋值为1，在下一行重新开始
    i +=1#增加行数